[
    {
        "company": "American Express",
        "title": "Engineer II",
        "startMonth": "June 2023",
        "endMonth": "Current",
        "summary": "Developed and enhanced applications for American Express partners and internal teams using React.js, Spring Boot, and Node.js. Involved in writing new features, debugging, and effectively communicating with stakeholders.",
        "points": [
            "Built a transaction search UI to streamline data access for internal teams.",
            "Enhanced user management systems to enable secure onboarding and role-based access for 60+ network partners, along with upgrading dispute management systems to improve transaction dispute resolution.",
            "Containerized a monolith application using Docker, reducing deployment time by 50% and minimizing errors. The application facilitates partner onboarding and acts as an information hub for network partners."
        ],
        "logo": "amex.png",
        "logoUrl": "https://www.linkedin.com/company/american-express/"
    },
    {
        "company": "Nokia Networks and Solutions",
        "title": "Solution Engineer",
        "startMonth": "July 2021",
        "endMonth": "June 2023",
        "summary": "At Nokia, I honed my skills in core Java and frontend technologies, contributing to major projects for clients like AT&T and Verizon. This experience laid a solid foundation in enterprise-level software development and teamwork.",
        "points": [
            "Developed core Java products to automate auditing of configurations for Nokia's mobile network services, enhancing efficiency.",
            "Created a responsive UI for Nokia partners to request special features on Nokia Mobile Networks using React.js and Redux."
        ],
        "logo": "nokia.png",
        "logoUrl": "https://www.linkedin.com/company/nokia/"
    },
    {
        "company": "Bachelors In Technology",
        "title": "NIT Surat",
        "startMonth": "June 2017",
        "endMonth": "July 2021",
        "summary": "Electrical Engineering",
        "points": [],
        "logo": "svnit.png",
        "logoUrl": "https://www.svnit.ac.in/"
    }
]